{
    "A#:7/5": 0,
    "A#:7/b7": 1,
    "A#:aug": 2,
    "A#:dim": 3,
    "A#:dim7": 4,
    "A#:maj": 5,
    "A#:maj/3": 6,
    "A#:maj/5": 7,
    "A#:maj6": 8,
    "A#:maj7": 9,
    "A#:maj7/3": 10,
    "A#:maj7/5": 11,
    "A#:maj7/7": 12,
    "A#:min": 13,
    "A#:min/5": 14,
    "A#:min6": 15,
    "A#:min7/b7": 16,
    "A#:minmaj7": 17,
    "A#:sus2": 18,
    "A#:sus4": 19,
    "A#:sus4(b7)": 20,
    "A:7": 21,
    "A:7/3": 22,
    "A:7/5": 23,
    "A:7/b7": 24,
    "A:aug": 25,
    "A:dim": 26,
    "A:hdim7": 27,
    "A:maj": 28,
    "A:maj/3": 29,
    "A:maj/5": 30,
    "A:maj6": 31,
    "A:maj7": 32,
    "A:maj7/3": 33,
    "A:maj7/5": 34,
    "A:maj7/7": 35,
    "A:min": 36,
    "A:min/5": 37,
    "A:min/b3": 38,
    "A:min6": 39,
    "A:min7": 40,
    "A:min7/5": 41,
    "A:min7/b7": 42,
    "A:minmaj7": 43,
    "A:sus2": 44,
    "A:sus4": 45,
    "A:sus4(b7)": 46,
    "B:7": 47,
    "B:7/5": 48,
    "B:aug": 49,
    "B:dim": 50,
    "B:dim7": 51,
    "B:hdim7": 52,
    "B:maj": 53,
    "B:maj/3": 54,
    "B:maj/5": 55,
    "B:maj7": 56,
    "B:maj7/7": 57,
    "B:min": 58,
    "B:min/5": 59,
    "B:min/b3": 60,
    "B:min6": 61,
    "B:min7": 62,
    "B:min7/5": 63,
    "B:min7/b7": 64,
    "B:sus2": 65,
    "B:sus4": 66,
    "B:sus4(b7)": 67,
    "C#:7/5": 68,
    "C#:7/b7": 69,
    "C#:aug": 70,
    "C#:dim": 71,
    "C#:hdim7": 72,
    "C#:maj": 73,
    "C#:maj/3": 74,
    "C#:maj/5": 75,
    "C#:maj7/7": 76,
    "C#:min": 77,
    "C#:min/5": 78,
    "C#:min/b3": 79,
    "C#:min7/b7": 80,
    "C#:minmaj7": 81,
    "C#:sus2": 82,
    "C:7": 83,
    "C:7/3": 84,
    "C:7/5": 85,
    "C:7/b7": 86,
    "C:aug": 87,
    "C:dim": 88,
    "C:dim7": 89,
    "C:maj": 90,
    "C:maj/3": 91,
    "C:maj/5": 92,
    "C:maj6": 93,
    "C:maj7": 94,
    "C:maj7/3": 95,
    "C:maj7/5": 96,
    "C:maj7/7": 97,
    "C:min": 98,
    "C:min/5": 99,
    "C:min/b3": 100,
    "C:min7": 101,
    "C:min7/5": 102,
    "C:min7/b7": 103,
    "C:sus2": 104,
    "C:sus4": 105,
    "C:sus4(b7)": 106,
    "D#:7": 107,
    "D#:aug": 108,
    "D#:dim": 109,
    "D#:dim7": 110,
    "D#:maj": 111,
    "D#:maj/3": 112,
    "D#:maj/5": 113,
    "D#:maj6": 114,
    "D#:maj7": 115,
    "D#:maj7/3": 116,
    "D#:maj7/7": 117,
    "D#:min": 118,
    "D#:min6": 119,
    "D#:min7": 120,
    "D#:sus2": 121,
    "D#:sus4(b7)": 122,
    "D:7": 123,
    "D:7/3": 124,
    "D:7/5": 125,
    "D:7/b7": 126,
    "D:aug": 127,
    "D:dim": 128,
    "D:dim7": 129,
    "D:hdim7": 130,
    "D:maj": 131,
    "D:maj/3": 132,
    "D:maj/5": 133,
    "D:maj6": 134,
    "D:maj7": 135,
    "D:maj7/5": 136,
    "D:maj7/7": 137,
    "D:min": 138,
    "D:min/5": 139,
    "D:min/b3": 140,
    "D:min6": 141,
    "D:min7": 142,
    "D:min7/5": 143,
    "D:min7/b7": 144,
    "D:minmaj7": 145,
    "D:sus2": 146,
    "D:sus4": 147,
    "D:sus4(b7)": 148,
    "E:7": 149,
    "E:7/3": 150,
    "E:7/5": 151,
    "E:7/b7": 152,
    "E:aug": 153,
    "E:dim": 154,
    "E:dim7": 155,
    "E:hdim7": 156,
    "E:maj": 157,
    "E:maj/3": 158,
    "E:maj/5": 159,
    "E:maj7": 160,
    "E:maj7/7": 161,
    "E:min": 162,
    "E:min/5": 163,
    "E:min/b3": 164,
    "E:min7": 165,
    "E:min7/5": 166,
    "E:min7/b7": 167,
    "E:sus2": 168,
    "E:sus4": 169,
    "E:sus4(b7)": 170,
    "F#:7/3": 171,
    "F#:aug": 172,
    "F#:dim": 173,
    "F#:dim7": 174,
    "F#:hdim7": 175,
    "F#:maj": 176,
    "F#:maj/3": 177,
    "F#:maj/5": 178,
    "F#:maj7": 179,
    "F#:maj7/3": 180,
    "F#:maj7/7": 181,
    "F#:min": 182,
    "F#:min/5": 183,
    "F#:min/b3": 184,
    "F#:min7": 185,
    "F#:min7/b7": 186,
    "F#:minmaj7": 187,
    "F#:sus2": 188,
    "F#:sus4(b7)": 189,
    "F:7": 190,
    "F:7/5": 191,
    "F:7/b7": 192,
    "F:aug": 193,
    "F:dim": 194,
    "F:dim7": 195,
    "F:maj": 196,
    "F:maj/3": 197,
    "F:maj/5": 198,
    "F:maj6": 199,
    "F:maj7": 200,
    "F:maj7/3": 201,
    "F:maj7/5": 202,
    "F:maj7/7": 203,
    "F:min": 204,
    "F:min/5": 205,
    "F:min/b3": 206,
    "F:min6": 207,
    "F:min7": 208,
    "F:minmaj7": 209,
    "F:sus2": 210,
    "F:sus4": 211,
    "F:sus4(b7)": 212,
    "G#:7": 213,
    "G#:7/5": 214,
    "G#:aug": 215,
    "G#:dim": 216,
    "G#:dim7": 217,
    "G#:hdim7": 218,
    "G#:maj": 219,
    "G#:maj/3": 220,
    "G#:maj6": 221,
    "G#:maj7": 222,
    "G#:maj7/3": 223,
    "G#:maj7/7": 224,
    "G#:min": 225,
    "G#:min/b3": 226,
    "G#:min6": 227,
    "G#:min7": 228,
    "G#:min7/b7": 229,
    "G#:minmaj7": 230,
    "G#:sus2": 231,
    "G#:sus4(b7)": 232,
    "G:7": 233,
    "G:7/3": 234,
    "G:7/5": 235,
    "G:7/b7": 236,
    "G:aug": 237,
    "G:dim": 238,
    "G:maj": 239,
    "G:maj/3": 240,
    "G:maj/5": 241,
    "G:maj6": 242,
    "G:maj7": 243,
    "G:maj7/3": 244,
    "G:maj7/7": 245,
    "G:min": 246,
    "G:min/5": 247,
    "G:min/b3": 248,
    "G:min6": 249,
    "G:min7": 250,
    "G:min7/5": 251,
    "G:min7/b7": 252,
    "G:sus2": 253,
    "G:sus4": 254,
    "G:sus4(b7)": 255,
    "N": 256,
    "PAD": 257,
    "BOS": 258,
    "EOS": 259
}