{
    "A#:7/5": 0,
    "A#:7/b7": 1,
    "A#:aug": 2,
    "A#:dim": 3,
    "A#:dim7": 4,
    "A#:maj": 5,
    "A#:maj/3": 6,
    "A#:maj/5": 7,
    "A#:maj6": 8,
    "A#:maj7": 9,
    "A#:maj7/3": 10,
    "A#:maj7/5": 11,
    "A#:maj7/7": 12,
    "A#:min": 13,
    "A#:min/5": 14,
    "A#:min6": 15,
    "A#:min7/b7": 16,
    "A#:minmaj7": 17,
    "A#:sus2": 18,
    "A#:sus4": 19,
    "A#:sus4(b7)": 20,
    "A:7": 21,
    "A:7/3": 22,
    "A:7/5": 23,
    "A:7/b7": 24,
    "A:aug": 25,
    "A:dim": 26,
    "A:hdim7": 27,
    "A:maj": 28,
    "A:maj/3": 29,
    "A:maj/5": 30,
    "A:maj6": 31,
    "A:maj7": 32,
    "A:maj7/3": 33,
    "A:maj7/5": 34,
    "A:maj7/7": 35,
    "A:min": 36,
    "A:min/5": 37,
    "A:min/b3": 38,
    "A:min6": 39,
    "A:min7": 40,
    "A:min7/5": 41,
    "A:min7/b7": 42,
    "A:minmaj7": 43,
    "A:sus2": 44,
    "A:sus4": 45,
    "A:sus4(b7)": 46,
    "B:7": 47,
    "B:7/5": 48,
    "B:aug": 49,
    "B:dim": 50,
    "B:dim7": 51,
    "B:hdim7": 52,
    "B:maj": 53,
    "B:maj/3": 54,
    "B:maj/5": 55,
    "B:maj7/7": 56,
    "B:min": 57,
    "B:min/5": 58,
    "B:min/b3": 59,
    "B:min6": 60,
    "B:min7": 61,
    "B:min7/5": 62,
    "B:min7/b7": 63,
    "B:sus2": 64,
    "B:sus4": 65,
    "B:sus4(b7)": 66,
    "C#:7/5": 67,
    "C#:7/b7": 68,
    "C#:aug": 69,
    "C#:dim": 70,
    "C#:hdim7": 71,
    "C#:maj": 72,
    "C#:maj/3": 73,
    "C#:maj/5": 74,
    "C#:maj7/7": 75,
    "C#:min": 76,
    "C#:min/5": 77,
    "C#:min/b3": 78,
    "C#:min7/b7": 79,
    "C#:minmaj7": 80,
    "C#:sus2": 81,
    "C:7": 82,
    "C:7/3": 83,
    "C:7/5": 84,
    "C:7/b7": 85,
    "C:aug": 86,
    "C:dim": 87,
    "C:dim7": 88,
    "C:maj": 89,
    "C:maj/3": 90,
    "C:maj/5": 91,
    "C:maj6": 92,
    "C:maj7": 93,
    "C:maj7/3": 94,
    "C:maj7/5": 95,
    "C:maj7/7": 96,
    "C:min": 97,
    "C:min/5": 98,
    "C:min/b3": 99,
    "C:min7": 100,
    "C:min7/5": 101,
    "C:min7/b7": 102,
    "C:sus2": 103,
    "C:sus4": 104,
    "C:sus4(b7)": 105,
    "D#:7": 106,
    "D#:aug": 107,
    "D#:dim": 108,
    "D#:dim7": 109,
    "D#:maj": 110,
    "D#:maj/3": 111,
    "D#:maj/5": 112,
    "D#:maj6": 113,
    "D#:maj7": 114,
    "D#:maj7/3": 115,
    "D#:maj7/7": 116,
    "D#:min": 117,
    "D#:min6": 118,
    "D#:min7": 119,
    "D#:sus2": 120,
    "D#:sus4(b7)": 121,
    "D:7": 122,
    "D:7/3": 123,
    "D:7/5": 124,
    "D:7/b7": 125,
    "D:aug": 126,
    "D:dim": 127,
    "D:dim7": 128,
    "D:hdim7": 129,
    "D:maj": 130,
    "D:maj/3": 131,
    "D:maj/5": 132,
    "D:maj6": 133,
    "D:maj7": 134,
    "D:maj7/5": 135,
    "D:maj7/7": 136,
    "D:min": 137,
    "D:min/5": 138,
    "D:min/b3": 139,
    "D:min6": 140,
    "D:min7": 141,
    "D:min7/5": 142,
    "D:min7/b7": 143,
    "D:minmaj7": 144,
    "D:sus2": 145,
    "D:sus4": 146,
    "D:sus4(b7)": 147,
    "E:7": 148,
    "E:7/3": 149,
    "E:7/5": 150,
    "E:7/b7": 151,
    "E:aug": 152,
    "E:dim": 153,
    "E:dim7": 154,
    "E:hdim7": 155,
    "E:maj": 156,
    "E:maj/3": 157,
    "E:maj/5": 158,
    "E:maj7": 159,
    "E:maj7/7": 160,
    "E:min": 161,
    "E:min/5": 162,
    "E:min/b3": 163,
    "E:min7": 164,
    "E:min7/5": 165,
    "E:min7/b7": 166,
    "E:sus2": 167,
    "E:sus4": 168,
    "E:sus4(b7)": 169,
    "F#:7/3": 170,
    "F#:aug": 171,
    "F#:dim": 172,
    "F#:dim7": 173,
    "F#:hdim7": 174,
    "F#:maj": 175,
    "F#:maj/3": 176,
    "F#:maj/5": 177,
    "F#:maj7": 178,
    "F#:maj7/3": 179,
    "F#:maj7/7": 180,
    "F#:min": 181,
    "F#:min/5": 182,
    "F#:min/b3": 183,
    "F#:min7": 184,
    "F#:min7/b7": 185,
    "F#:minmaj7": 186,
    "F#:sus2": 187,
    "F#:sus4(b7)": 188,
    "F:7": 189,
    "F:7/5": 190,
    "F:7/b7": 191,
    "F:aug": 192,
    "F:dim": 193,
    "F:dim7": 194,
    "F:maj": 195,
    "F:maj/3": 196,
    "F:maj/5": 197,
    "F:maj6": 198,
    "F:maj7": 199,
    "F:maj7/3": 200,
    "F:maj7/5": 201,
    "F:maj7/7": 202,
    "F:min": 203,
    "F:min/5": 204,
    "F:min/b3": 205,
    "F:min6": 206,
    "F:min7": 207,
    "F:minmaj7": 208,
    "F:sus2": 209,
    "F:sus4": 210,
    "F:sus4(b7)": 211,
    "G#:7": 212,
    "G#:7/5": 213,
    "G#:aug": 214,
    "G#:dim": 215,
    "G#:dim7": 216,
    "G#:hdim7": 217,
    "G#:maj": 218,
    "G#:maj/3": 219,
    "G#:maj/5": 220,
    "G#:maj6": 221,
    "G#:maj7": 222,
    "G#:maj7/3": 223,
    "G#:maj7/5": 224,
    "G#:maj7/7": 225,
    "G#:min": 226,
    "G#:min/b3": 227,
    "G#:min6": 228,
    "G#:min7": 229,
    "G#:min7/b7": 230,
    "G#:minmaj7": 231,
    "G#:sus2": 232,
    "G#:sus4(b7)": 233,
    "G:7": 234,
    "G:7/3": 235,
    "G:7/5": 236,
    "G:7/b7": 237,
    "G:aug": 238,
    "G:dim": 239,
    "G:maj": 240,
    "G:maj/3": 241,
    "G:maj/5": 242,
    "G:maj6": 243,
    "G:maj7": 244,
    "G:maj7/3": 245,
    "G:maj7/7": 246,
    "G:min": 247,
    "G:min/5": 248,
    "G:min/b3": 249,
    "G:min6": 250,
    "G:min7": 251,
    "G:min7/5": 252,
    "G:min7/b7": 253,
    "G:sus2": 254,
    "G:sus4": 255,
    "G:sus4(b7)": 256,
    "N": 257,
    "PAD": 258,
    "BOS": 259,
    "EOS": 260
}