{
  "vocab": {
    "PAD_None": 0,
    "BOS_None": 1,
    "EOS_None": 2,
    "MASK_None": 3,
    "Bar_None": 4,
    "Pitch_21": 5,
    "Pitch_22": 6,
    "Pitch_23": 7,
    "Pitch_24": 8,
    "Pitch_25": 9,
    "Pitch_26": 10,
    "Pitch_27": 11,
    "Pitch_28": 12,
    "Pitch_29": 13,
    "Pitch_30": 14,
    "Pitch_31": 15,
    "Pitch_32": 16,
    "Pitch_33": 17,
    "Pitch_34": 18,
    "Pitch_35": 19,
    "Pitch_36": 20,
    "Pitch_37": 21,
    "Pitch_38": 22,
    "Pitch_39": 23,
    "Pitch_40": 24,
    "Pitch_41": 25,
    "Pitch_42": 26,
    "Pitch_43": 27,
    "Pitch_44": 28,
    "Pitch_45": 29,
    "Pitch_46": 30,
    "Pitch_47": 31,
    "Pitch_48": 32,
    "Pitch_49": 33,
    "Pitch_50": 34,
    "Pitch_51": 35,
    "Pitch_52": 36,
    "Pitch_53": 37,
    "Pitch_54": 38,
    "Pitch_55": 39,
    "Pitch_56": 40,
    "Pitch_57": 41,
    "Pitch_58": 42,
    "Pitch_59": 43,
    "Pitch_60": 44,
    "Pitch_61": 45,
    "Pitch_62": 46,
    "Pitch_63": 47,
    "Pitch_64": 48,
    "Pitch_65": 49,
    "Pitch_66": 50,
    "Pitch_67": 51,
    "Pitch_68": 52,
    "Pitch_69": 53,
    "Pitch_70": 54,
    "Pitch_71": 55,
    "Pitch_72": 56,
    "Pitch_73": 57,
    "Pitch_74": 58,
    "Pitch_75": 59,
    "Pitch_76": 60,
    "Pitch_77": 61,
    "Pitch_78": 62,
    "Pitch_79": 63,
    "Pitch_80": 64,
    "Pitch_81": 65,
    "Pitch_82": 66,
    "Pitch_83": 67,
    "Pitch_84": 68,
    "Pitch_85": 69,
    "Pitch_86": 70,
    "Pitch_87": 71,
    "Pitch_88": 72,
    "Pitch_89": 73,
    "Pitch_90": 74,
    "Pitch_91": 75,
    "Pitch_92": 76,
    "Pitch_93": 77,
    "Pitch_94": 78,
    "Pitch_95": 79,
    "Pitch_96": 80,
    "Pitch_97": 81,
    "Pitch_98": 82,
    "Pitch_99": 83,
    "Pitch_100": 84,
    "Pitch_101": 85,
    "Pitch_102": 86,
    "Pitch_103": 87,
    "Pitch_104": 88,
    "Pitch_105": 89,
    "Pitch_106": 90,
    "Pitch_107": 91,
    "Pitch_108": 92,
    "Pitch_109": 93,
    "Velocity_15": 94,
    "Velocity_31": 95,
    "Velocity_47": 96,
    "Velocity_63": 97,
    "Velocity_79": 98,
    "Velocity_95": 99,
    "Velocity_111": 100,
    "Velocity_127": 101,
    "Duration_0.1.4": 102,
    "Duration_0.2.4": 103,
    "Duration_0.3.4": 104,
    "Duration_1.0.4": 105,
    "Duration_1.1.4": 106,
    "Duration_1.2.4": 107,
    "Duration_1.3.4": 108,
    "Duration_2.0.4": 109,
    "Duration_2.1.4": 110,
    "Duration_2.2.4": 111,
    "Duration_2.3.4": 112,
    "Duration_3.0.4": 113,
    "Duration_3.1.4": 114,
    "Duration_3.2.4": 115,
    "Duration_3.3.4": 116,
    "Duration_4.0.4": 117,
    "Duration_4.1.4": 118,
    "Duration_4.2.4": 119,
    "Duration_4.3.4": 120,
    "Duration_5.0.4": 121,
    "Duration_5.1.4": 122,
    "Duration_5.2.4": 123,
    "Duration_5.3.4": 124,
    "Duration_6.0.4": 125,
    "Duration_6.1.4": 126,
    "Duration_6.2.4": 127,
    "Duration_6.3.4": 128,
    "Duration_7.0.4": 129,
    "Duration_7.1.4": 130,
    "Duration_7.2.4": 131,
    "Duration_7.3.4": 132,
    "Duration_8.0.4": 133,
    "Position_0": 134,
    "Position_1": 135,
    "Position_2": 136,
    "Position_3": 137,
    "Position_4": 138,
    "Position_5": 139,
    "Position_6": 140,
    "Position_7": 141,
    "Position_8": 142,
    "Position_9": 143,
    "Position_10": 144,
    "Position_11": 145,
    "Position_12": 146,
    "Position_13": 147,
    "Position_14": 148,
    "Position_15": 149,
    "PitchDrum_27": 150,
    "PitchDrum_28": 151,
    "PitchDrum_29": 152,
    "PitchDrum_30": 153,
    "PitchDrum_31": 154,
    "PitchDrum_32": 155,
    "PitchDrum_33": 156,
    "PitchDrum_34": 157,
    "PitchDrum_35": 158,
    "PitchDrum_36": 159,
    "PitchDrum_37": 160,
    "PitchDrum_38": 161,
    "PitchDrum_39": 162,
    "PitchDrum_40": 163,
    "PitchDrum_41": 164,
    "PitchDrum_42": 165,
    "PitchDrum_43": 166,
    "PitchDrum_44": 167,
    "PitchDrum_45": 168,
    "PitchDrum_46": 169,
    "PitchDrum_47": 170,
    "PitchDrum_48": 171,
    "PitchDrum_49": 172,
    "PitchDrum_50": 173,
    "PitchDrum_51": 174,
    "PitchDrum_52": 175,
    "PitchDrum_53": 176,
    "PitchDrum_54": 177,
    "PitchDrum_55": 178,
    "PitchDrum_56": 179,
    "PitchDrum_57": 180,
    "PitchDrum_58": 181,
    "PitchDrum_59": 182,
    "PitchDrum_60": 183,
    "PitchDrum_61": 184,
    "PitchDrum_62": 185,
    "PitchDrum_63": 186,
    "PitchDrum_64": 187,
    "PitchDrum_65": 188,
    "PitchDrum_66": 189,
    "PitchDrum_67": 190,
    "PitchDrum_68": 191,
    "PitchDrum_69": 192,
    "PitchDrum_70": 193,
    "PitchDrum_71": 194,
    "PitchDrum_72": 195,
    "PitchDrum_73": 196,
    "PitchDrum_74": 197,
    "PitchDrum_75": 198,
    "PitchDrum_76": 199,
    "PitchDrum_77": 200,
    "PitchDrum_78": 201,
    "PitchDrum_79": 202,
    "PitchDrum_80": 203,
    "PitchDrum_81": 204,
    "PitchDrum_82": 205,
    "PitchDrum_83": 206,
    "PitchDrum_84": 207,
    "PitchDrum_85": 208,
    "PitchDrum_86": 209,
    "PitchDrum_87": 210,
    "PitchDrum_88": 211,
    "Program_0": 212,
    "Program_1": 213,
    "Program_2": 214,
    "Program_3": 215,
    "Program_4": 216,
    "Program_5": 217,
    "Program_6": 218,
    "Program_7": 219,
    "Program_8": 220,
    "Program_9": 221,
    "Program_10": 222,
    "Program_11": 223,
    "Program_12": 224,
    "Program_13": 225,
    "Program_14": 226,
    "Program_15": 227,
    "Program_16": 228,
    "Program_17": 229,
    "Program_18": 230,
    "Program_19": 231,
    "Program_20": 232,
    "Program_21": 233,
    "Program_22": 234,
    "Program_23": 235,
    "Program_24": 236,
    "Program_25": 237,
    "Program_26": 238,
    "Program_27": 239,
    "Program_28": 240,
    "Program_29": 241,
    "Program_30": 242,
    "Program_31": 243,
    "Program_32": 244,
    "Program_33": 245,
    "Program_34": 246,
    "Program_35": 247,
    "Program_36": 248,
    "Program_37": 249,
    "Program_38": 250,
    "Program_39": 251,
    "Program_40": 252,
    "Program_41": 253,
    "Program_42": 254,
    "Program_43": 255,
    "Program_44": 256,
    "Program_45": 257,
    "Program_46": 258,
    "Program_47": 259,
    "Program_48": 260,
    "Program_49": 261,
    "Program_50": 262,
    "Program_51": 263,
    "Program_52": 264,
    "Program_53": 265,
    "Program_54": 266,
    "Program_55": 267,
    "Program_56": 268,
    "Program_57": 269,
    "Program_58": 270,
    "Program_59": 271,
    "Program_60": 272,
    "Program_61": 273,
    "Program_62": 274,
    "Program_63": 275,
    "Program_64": 276,
    "Program_65": 277,
    "Program_66": 278,
    "Program_67": 279,
    "Program_68": 280,
    "Program_69": 281,
    "Program_70": 282,
    "Program_71": 283,
    "Program_72": 284,
    "Program_73": 285,
    "Program_74": 286,
    "Program_75": 287,
    "Program_76": 288,
    "Program_77": 289,
    "Program_78": 290,
    "Program_79": 291,
    "Program_80": 292,
    "Program_81": 293,
    "Program_82": 294,
    "Program_83": 295,
    "Program_84": 296,
    "Program_85": 297,
    "Program_86": 298,
    "Program_87": 299,
    "Program_88": 300,
    "Program_89": 301,
    "Program_90": 302,
    "Program_91": 303,
    "Program_92": 304,
    "Program_93": 305,
    "Program_94": 306,
    "Program_95": 307,
    "Program_96": 308,
    "Program_97": 309,
    "Program_98": 310,
    "Program_99": 311,
    "Program_100": 312,
    "Program_101": 313,
    "Program_102": 314,
    "Program_103": 315,
    "Program_104": 316,
    "Program_105": 317,
    "Program_106": 318,
    "Program_107": 319,
    "Program_108": 320,
    "Program_109": 321,
    "Program_110": 322,
    "Program_111": 323,
    "Program_112": 324,
    "Program_113": 325,
    "Program_114": 326,
    "Program_115": 327,
    "Program_116": 328,
    "Program_117": 329,
    "Program_118": 330,
    "Program_119": 331,
    "Program_120": 332,
    "Program_121": 333,
    "Program_122": 334,
    "Program_123": 335,
    "Program_124": 336,
    "Program_125": 337,
    "Program_126": 338,
    "Program_127": 339,
    "Program_-1": 340
  }
}